# CannotRedoFaceBased Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..WallFailures..::..CannotRedoFaceBased Property
BuiltInFailures..::..WallFailures Class See Also
---
Faces defining this Element cannot be reacquired.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotRedoFaceBased { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotRedoFaceBased As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotRedoFaceBased {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..WallFailures Class
Autodesk.Revit.DB Namespace